app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "What is that about?"], ["created_at", Sat, 03 Oct 2015 06:10:27 UTC +00:00], ["title", "Lotsa lotsa"], ["updated_at", Sat, 03 Oct 2015 06:10:27 UTC +00:00]]
---
  def create
    @article = Article.new
    @article = Article.new(article_params)
    # @article.title = params[:article][:title]
    # @article.body = params[:article][:body]
    @article.save